[AltTechTree]
#	RESEARCH TECHS
#	Powered Armors
altTechTypeNames[16]="Powered Armors"
altTechTypeSummary[16]="\"In order to stand up against the enemy forces we need to adapt our armor to better protect the soldiers we send out.  Our scientists want to spend some time combining the element we call Elerium with the alien alloys and see what results they get.\""
altTechTypeCodeName[16]="Rictus"
altTechTypeReport[16]="We now have some ideas on how to incorporate the element known as elerium into our basic armor designs, providing bursts of powered assist to our soldiers when necessary. The protective qualities of this armor have been maintained through the use of a multilayered composite lining within the suit.\n\nThe integration of a pneumatic grapple unit provides our troops with the ability to scale objects for a tactical height advantage when needed. Some designs also incorporate micro-servomotors utilized to augment the reflexes of anyone wearing the suit, improving the odds that the operator will avoid incoming enemy fire, while also increasing the available movement range."

#	Advanced Powered Armors
altTechTypeNames[17]="Advanced Powered Armors"
altTechTypeSummary[17]="\"We've observed some of the alien combatants wearing a form of superheavy armor that still allows for full mobility in combat. This has been puzzling, to say the least, but with our new understanding of the alien energy sources and their materials, we could develop powered armor of our own, as well as further enhance our MECs' capabilities.\""
altTechTypeCodeName[17]="Golem"
altTechTypeReport[17]="We've managed to adapt the alien technology to our own allowing us to manipulate them in ways we only ever imagined.  We would like to hand our findings over to Dr. Shen and his Engineers to see what they can come up with.  With the element in short supply, we've tried to find the most efficient means to utilize it in our development programs.\n\nIn this case, the Elerium power cell is used to fuel an integrated cooling system designed to minimize fatigue by regulating the operator's body temperature. This system gives our armors the added benefit of increased resistance to environmental hazards."

#	Alien Cybernetics
altTechTypeNames[11]="Alien Cybernetics"
altTechTypeSummary[11]="\"Although our understanding of the alien technology is still limited, what we've seen so far is enough to revolutionize combat as we know it.  The aliens possess an advanced knowledge of Cybernetics that far surpasses our own, we must adapt in order to meet the new challenge.\""
altTechTypeCodeName[11]="Skunk Works"
altTechTypeReport[11]="The floater specimen, along with the alien weapon fragments and alloys, has given us a better grasp on where we need to focus future efforts in adapting our technology.  Dr. Shen has expressed that he is confident his Engineers can take our adapted concepts and make them a reality."

#	Beam Weaponry
altTechTypeNames[20]="Beam Weaponry"
altTechTypeSummary[20]="\"A group of our scientists have become really excited since getting their hands on these alien weapon fragments.  Laser technology exists in a limited degree already, this group is confident that focusing on advancing laser technology would be the best course of action.  Imagine mobile laser technology, the results will speak for themselves.  WARNING!  CHOOSING THIS PATH REMOVES THE OPTION TO RESEARCH ADVANCED BALLISTICS!\""
altTechTypeCodeName[20]="Sunray"
altTechTypeReport[20]="We've finally found a workable solution to the heat dissipation issues we've struggled with when attempting to create a laser weapon for our troops. Although these variants still operate near the limit of what would ordinarily be considered \"safe\" operating temperatures, we believe they are stable enough at this point to begin fabrication in engineering."

#	Advanced Beam Weaponry
altTechTypeNames[21]="Advanced Beam Weaponry"
altTechTypeSummary[21]="\"We believe we should be able to develop some more specialized beam weaponry for some of the troops. Our early experiments with oversized coolant coils and double lensing have shown the potential to greatly increase their firepower as well as accuracy.\""
altTechTypeCodeName[21]="Lightwire"
altTechTypeReport[21]="Thanks to the additional focus on our Beam Technology we've managed to overcome many of the shortcomings from our orignal, rushed, models.  We can re-outfit our existing beam weaponry to further increase their accuracy as well as their ability to inflict critical damage on targets.  The ability to make better use the energy our beam weaponry outputs will allow additional shots before recharge.  Output values are as follows: \n\nAim + 9 \n\nCritical + 10 \n\nAmmo + 1"

#	Pulse Weaponry
altTechTypeNames[22]="Pulse Weaponry"
altTechTypeSummary[22]="\"Our studies of alien power systems have enabled us to develop ideas for a second generation of 'pulse' laser weaponry that should be able to do significantly greater damage to alien targets than our existing beam weapons.\""
altTechTypeCodeName[22]="Penumbra"
altTechTypeReport[22]="By studying the methods used by the aliens to manage energy consumption and heat dissipation in their weapons, we've advanced our existing laser-based weaponry designs well beyond what we had previously envisioned. Remarkably, we now have a working pulse laser prototype that is capable of inflicting massive damage. Although we've had to reduce the size of the focusing lenses in the process, and thus lost some of the accuracy our beam lasers possessed, the increase in firepower is a worthwhile tradeoff."

#	Micro Technologies
altTechTypeNames[23]="Micro Technologies"
altTechTypeSummary[23]="\"Many of our scientists have taken an interest in how the Alien's Plasma weapons are still quite powerful, even when smaller in size.  They would like to focus on studying ways to apply this concept to our own weapons.\""
altTechTypeCodeName[23]="Jacamar"
altTechTypeReport[23]="Thanks to the additional time spent on micro technology we have been able to solve many of the power issues we were running into when trying to reduce the size and weight of our weapons.  Using this knowledge, and working with the Engineering team, will allow much lighter weight weaponry without sacrificing too much of it's performance.  This is a victory for our soldiers as they won't have to worry about being slowed down as greatly under the weight of the new weaponry we're designing."

#	Advanced Cooling Technology
altTechTypeNames[26]="Advanced Cooling Technology"
altTechTypeSummary[26]="\"Despite a number of impressive advances, I am still in awe of the alien's mastery of plasma-based weapons.  They are able to provide an impressive discharge of energy without overheating their weapons, it's time we turned our attention to advancing our cooling technology.\""
altTechTypeCodeName[26]="Kingfisher"
altTechTypeReport[26]="Success!  We've managed to develop a system that properly disperses excess heat, the technology is of course still in prototype and would need to be modified for each individual weapon and style, but we've increased heat dispersion by 150%.  The material the alien alloys are made of was a huge boon in this process, I doubt we have anything on earth that matches the usefulness of the alloys we're now able to work with.  We'll hand this over to Dr. Shen immediately for use in future weapoon production."

#	Advanced Ballistic Weaponry
altTechTypeNames[27]="Advanced Ballistic Weaponry"
altTechTypeSummary[27]="\"Initial impressions of even the weapon fragments from the alien weapons has given the lab some ideas.  Some of the scientists really think it would be beneficial to focus all our efforts on utilizing alien technology to further advance the weaponry our soldiers are already familiar with, Ballistics.  WARNING!  CHOOSING THIS PATH REMOVES THE OPTION TO RESEARCH BEAM WEAPONRY!\""
altTechTypeCodeName[27]="Osprey"
altTechTypeReport[27]="In the goal of furthering our projectile weaponry it has been deemed necessary to explore what it is that differenciates the alien technology and materials from our own.  In this endeavor we have succeeded in opening up new possibilities, utilizing not only the alloys, but also bits of technology we've recovered thus far from the aliens.  \n\nWhat we have learned will allow us to push the limits of our Ballistic Weapons, however, if we want to take this technology further we will have to modify our existing weapons in order to accomodate the extra strain this alien technology places on the weapons themselves."

#	Advanced Fusion Weaponry
altTechTypeNames[29]="Advanced Fusion Weaponry"
altTechTypeSummary[29]="\"With additional insulation to protect their computers, it should be possible to equip our Interceptors and SHIVs with more powerful weapons. By integrating a larger version of the containment housing developed for our fusion weaponry, the end result would be extremely effective vehicle-based fusion cannon.\""
altTechTypeCodeName[29]="Snapdragon"
altTechTypeReport[29]="As we've continually strived to \"even the odds\" for our pilots facing the alien craft in combat, one of our most important developments was the ability to use and modify the alien plasma-based weaponry. Having successfully modified their weapons to the versions for our soldiers, the most difficult part of our work was already done. Increasing the size and firepower of these weapons for an application suitable to our Interceptors and SHIVs was a relatively straightforward process. Once we confirmed that the units themselves could handle the stress associated with firing these weapons, it was simply a matter of scaling up the device and creating an appropriate mount. \n\nWe believe these plasma cannon are now ready for general fabrication in engineering, and I'm confident our pilots will appreciate the additional firepower it provides.  The advancements don't stop there, we are able to increase the damage output of all our Fusion Weapons."

#	Gene Mod Recovery
altTechTypeNames[73]="Gene Mod Recovery"
altTechTypeSummary[73]="\"Since we discovered the substance we now refer to as MELD we have had a small group of our scientists working around the clock to push this substance to it's limitations.  With more support in their research I am assured any Gene-modded soldiers will have a much quicker recovery from both exhaustion and injury.\""
altTechTypeCodeName[73]="Harrier"
altTechTypeReport[73]="With further research into the material we've classified as Meld we've discovered a simpler way to adapt it to our own bodies.  Rather than causing more strain on our soldiers in the field the Meld is actually helping to speed the recovery of not only injuries, but also basic muscle regeneration.  This material is proving more and more impressive, our gene-modded soldiers will now have significantly reduced fatigue times after missions."

#	Mobile Combat Exoskeletons
altTechTypeNames[74]="Mobile Combat Exoskeletons"
altTechTypeSummary[74]="\"Our studies of mechanized warfare have taken us along two paths, mobility and survivability. Pursing this path, we believe can develop fast, capable combat suits that specialize in scouting, flanking and quick reaction on the battlefield.\""
altTechTypeCodeName[74]="Vigilant"
altTechTypeReport[74]="The MEC-6 suit we can now build is a fast, agile combat exoskeleton that should serve well in such positions as scout, flanker and quick assault units.  The Engineers are excited to get their hands on the tech and believe they can further improve on this design."

#	Heavy Combat Exoskeletons
altTechTypeNames[75]="Heavy Combat Exoskeletons"
altTechTypeSummary[75]="\"We can further develop our combat exoskeletons with a premium on survivability against sustained enemy fire, although mobility will be limited.\""
altTechTypeCodeName[75]="Abrams"
altTechTypeReport[75]="The MEC-4 can sustain an incredible amount of damage on the battlefield and continue to function, giving us a literal tank to field under the control of one of our augmented soldiers.  Once again our Engineers have expressed an interest in looking into the design specifications more closely, maybe they can take the concept even further."

#	FOUNDRY PROJECTS
#	MEC Exoskeleton Advancements
foundryTechNames[47]="MEC Exoskeleton Advancements"
foundryTechSummary[47]="Ever since the Lab Rats helped us create this technology we have been making constant tweaks.  Our hands on experience with the Paladin Armor has yielded results, though slightly limited.  Allow me to introduce the Defender and the Valiant MEC suits.  One adds to the armor while the other focuses on mobility."

#	Improved MEC Defense Systems
foundryTechNames[48]="Improved MEC Defense Systems"
foundryTechSummary[48]="Our experiments with the Alien Alloys have yielded further results.  Though the exact science behind these alloys still eludes us we have been fairly successful with their manipulation.  Utilizing these alloys for the joints of the MECs will protect the weaker points without sacrificing mobility."

#	Improved MEC Power Systems
foundryTechNames[49]="Improved MEC Power Systems"
foundryTechSummary[49]="The Elerium is really quite a unique power source, we are constantly finding new ways to apply it for use in our systems.  Currently it is still fairly volatile, but using small amounts to supplement our MEC armors allows even better mobility."

#	Beam Cooling Systems
foundryTechNames[50]="Beam Cooling Systems"
foundryTechSummary[50]="The initial prototype the lab gave us was a great starting point, but was lacking in several ways.  Now that the Engineers have been able to examine it these flaws are being worked out.  We have managed to utilize cryogenic technology to improve upon the cooling system.  We can now reduce the size and weight of the laser weapons and create a few additional designs."

#	Beam Weapon Alloy Chasis
foundryTechNames[51]="Beam Weapon Alloy Chasis"
foundryTechSummary[51]="The alien alloys have been a constant focus, though utilizing them as projectiles has been abandoned we are able to increase the power output of our laser technology by lining the core and barrel with these alloys.  It also allows us to further reduce the weight and size of our weapons if you want to go that route."

#	Advanced Beam Discharge
foundryTechNames[52]="Advanced Beam Discharge"
foundryTechSummary[52]="Elerium has allowed us to further increase the power output, though only on much larger weaponry.  Our mechanical units will be able to equip these weapons to provide superior firepower in the field."

#	Gauss Improved Ammo Casing
foundryTechNames[53]="Gauss Improved Ammo Casing"
foundryTechSummary[53]="Further experimentation with the alien alloys has allowed us to create a casing able to contain the Alloy Shards long enough to discharge them from our weapons.  This will allow us to increase the range our Gauss Weaponry is able to fire."

#	Gauss Fused Chamber
foundryTechNames[54]="Gauss Fused Chamber"
foundryTechSummary[54]="Early experiments with reducing the size of our Gauss Weaponry resulted in...well failure.  The chamber repeatedly separated from the rest of the weapon causing shots to be way off the intended target at best and causing the weapon to explode at worst.  We have adapted our technology and use a chamber that is fused into the weapon, the accuracy of course suffers, but we’re able to reduce the weapon size significantly."

#	Gauss Interchangeable Core
foundryTechNames[55]="Gauss Interchangeable Core"
foundryTechSummary[55]="Despite our best efforts at increasing the output damage we have been unable to find a way to do so without the core of the weapon becoming overheated and quickly warped.  For this reason our Engineers devised a method of exchanging the core before it becomes warped and without taking our soldier out of the fight.  It is now removed along with the magazine."

#	Pulse Discharge Adaptation
foundryTechNames[56]="Pulse Discharge Adaptation"
foundryTechSummary[56]="With the change from Beam to Pulse Weaponry we’ve managed to increase the overall energy output without sacrificing accuracy.  Due to the nature of the weapon type, armor penetration remains minimal but the increased energy output allows generally higher damage to all types of targets.  We’re able to further this technology in smaller weapon models which will allow more mobility in the field."

#	Enhanced Pulse Charge
foundryTechNames[57]="Enhanced Pulse Charge"
foundryTechSummary[57]="Our Engineering team has been playing around a bit with energy output of these new Pulse Weapons.  The result, though unexpected, was rather remarkable, we should be able to nearly double their energy output utilizing alien alloys as a form of shielding that holds the charge longer before firing.  The weapons will be much heavier in design but we believe they will be very useful in field operations."

#	Enhanced Fusion Concepts
foundryTechNames[58]="Enhanced Fusion Concepts"
foundryTechSummary[58]="The Fusion Cannon has been a tremendous victory for our scientists, we could have never even imagined it in a working model even a couple years ago.  But with a working model I’m certain our Engineers can further expand on this amazing achievement."
